Simulación/Validación/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-133.5 26.7 -5.0) //0
    (   0.0 26.7 -5.0) //1
    (   0.0 66.7 -5.0) //2
    (-133.5 66.7 -5.0) //3
    
    (-133.5 26.7  5.0) //4
    (   0.0 26.7  5.0) //5
    (   0.0 66.7  5.0) //6
    (-133.5 66.7  5.0) //7
    
    (934.5 26.7 -5.0) //8
    (934.5 66.7 -5.0) //9
    (934.5 26.7  5.0) //10
    (934.5 66.7  5.0) //11
    
    (  0.0 0.0 -5.0) //12
    (934.5 0.0 -5.0) //13
    (  0.0 0.0  5.0) //14
    (934.5 0.0  5.0) //15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (67 32 1) simpleGrading (1 ((0.5 0.5 5)(0.5 0.5 0.2)) 1)
    hex (1 8 9 2 5 10 11 6) (186 32 1) simpleGrading (5 ((0.5 0.5 5)(0.5 0.5 0.2)) 1)
    hex (12 13 8 1 14 15 10 5) (186 24 1) simpleGrading (5 ((0.5 0.5 5)(0.5 0.5 0.2)) 1)
);

edges
(
    
);

boundary
(
    inlet
    {
        /*
        type            mappedPatch;
        sampleMode      nearestCell;
        sampleRegion    region0;
        samplePatch     none;
        offsetMode      uniform;
        offset          (0.067 0 0);
        */
        
        type    patch;
        faces
        (
            (4 7 3 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (13 8 10 15)
            (8 9 11 10)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (2 6 11 9)
            (13 15 14 12)
            (14 5 1 12)
            (1 5 4 0)
        );
    }
    sides
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (1 2 9 8)
            (12 1 8 13)
            (5 6 7 4)
            (10 11 6 5)
            (15 10 5 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
