Simulación/Validación/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          32;
        startFace       24811;
    }
    outlet
    {
        type            patch;
        nFaces          56;
        startFace       24843;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          530;
        startFace       24899;
    }
    sides
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          25120;
        startFace       25429;
    }
)

// ************************************************************************* //
