Simulación/Validación/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.331;

boundaryField
{
    inlet
    {   
        type            zeroGradient;
        
        /*
        type                mapped;
        value               uniform 2e-05;
        interpolationScheme cell;
        setAverage          false;
        average             2e-05;
        */
    }
    outlet
    {
        type            zeroGradient;
    }    
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.331;
    }
    sides
    {
        type            empty;
    }  
}

// ************************************************************************* //
